v7/_special/dynamicMesh_MRF/pimple/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 0;
    }
    maxX
    {
        type            calculated;
        value           uniform 0;
    }
    minY
    {
        type            calculated;
        value           uniform 0;
    }
    maxY
    {
        type            calculated;
        value           uniform 0;
    }
    minZ
    {
        type            calculated;
        value           uniform 0;
    }
    maxZ
    {
        type            calculated;
        value           uniform 0;
    }
    rad
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
